app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(school_class_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "SQL"], ["room_number", 101], ["created_at", "2017-07-06 22:45:22.177252"], ["updated_at", "2017-07-06 22:45:22.177252"]]